source/_posts/2014-04-26-go面向对象和接口.html
---
title: "Golang面向对象编程"
date: 2014-04-26
layout: post
categories: Go
published: true
comments: true
---


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">GO 面向对象编程</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">哲学</h3>
<div class="outline-text-3" id="text-1-1">
<blockquote>
<p>
Less is more
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">区别</h3>
<div class="outline-text-3" id="text-1-2">
<p>
与Java、C++、Python等面向对象语言的区别
</p>
<ol class="org-ol">
<li>没有传统OOP编程中继承、虚函数、构造函数和析构函数、隐藏的this指针等概念。
</li>
<li>接口无需申明（静态类型的duck typing）。
</li>
<li>无侵式实现接口，接口与实现分离。
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">接口</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1">解释</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
接口就是一个协议，规定了一组成员。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">语法</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1">类</h4>
<div class="outline-text-4" id="text-1-4-1">
<div class="org-src-container">

<pre class="src src-go"><span style="color: #ff0000;">/* </span><span style="color: #ff0000;">&#23450;&#20041;&#19968;&#20010;&#24418;&#29366;&#31867;</span>
<span style="color: #ff0000;">   &#23454;&#29616;&#27491;&#26041;&#24418;&#35745;&#31639;&#38754;&#31215;&#30340;&#26041;&#27861;</span>
<span style="color: #ff0000;">   &#23454;&#29616;&#22278;&#35745;&#31639;&#38754;&#31215;&#30340;&#26041;&#27861;</span>
<span style="color: #ff0000;">*/</span>
<span style="color: #00ffff; font-weight: bold;">type</span> <span style="color: #00ff00;">Sharp</span> <span style="color: #00ffff; font-weight: bold;">struct</span> {
    r float64
}

<span style="color: #00ffff; font-weight: bold;">func</span> (s <span style="color: #00ff00;">Sharp</span>) <span style="color: #0000ff; font-weight: bold;">Square</span>() <span style="color: #00ff00;">float64</span>{
    <span style="color: #00ffff; font-weight: bold;">return</span> s.r * s.r
}

<span style="color: #00ffff; font-weight: bold;">func</span> (s <span style="color: #00ff00;">Sharp</span>) <span style="color: #0000ff; font-weight: bold;">Circle</span>() <span style="color: #00ff00;">float64</span>{
    <span style="color: #00ffff; font-weight: bold;">return</span> s.r * s.r * 3.14
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2">接口</h4>
<div class="outline-text-4" id="text-1-4-2">
<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff; font-weight: bold;">type</span> <span style="color: #00ff00;">Area</span> <span style="color: #00ffff; font-weight: bold;">interface</span> {
    <span style="color: #0000ff; font-weight: bold;">Square</span>() float64
    <span style="color: #0000ff; font-weight: bold;">Circle</span>() float64
}
<span style="color: #ff0000;">/* </span><span style="color: #ff0000;">&#19978;&#38754;&#31867;&#30340;&#20363;&#23376;&#27809;&#26377;&#32487;&#25215;&#25509;&#21475;&#65292;&#20294;&#26159;&#23454;&#29616;&#20102;&#25509;&#21475;&#30340;&#26041;&#27861;&#65292;&#25509;&#21475;&#26080;&#38656;&#32487;&#25215; */</span>
<span style="color: #ff0000;">/* </span><span style="color: #ff0000;">&#20351;&#29992; */</span>
<span style="color: #00ffff; font-weight: bold;">var</span> sharp Area = &amp;<span style="color: #00ff00;">sharp</span>{4}
sharp.<span style="color: #0000ff; font-weight: bold;">Square</span>()
sharp.<span style="color: #0000ff; font-weight: bold;">Circle</span>()
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4-3" class="outline-4">
<h4 id="sec-1-4-3">完整代码</h4>
<div class="outline-text-4" id="text-1-4-3">
<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff; font-weight: bold;">package</span> main

<span style="color: #00ffff; font-weight: bold;">import</span> <span style="color: #00ff00;">"fmt"</span>

<span style="color: #ff0000;">/* </span><span style="color: #ff0000;">&#23450;&#20041;&#19968;&#20010;&#24418;&#29366;&#31867;</span>
<span style="color: #ff0000;">   &#23454;&#29616;&#27491;&#26041;&#24418;&#35745;&#31639;&#38754;&#31215;&#30340;&#26041;&#27861;</span>
<span style="color: #ff0000;">   &#23454;&#29616;&#22278;&#35745;&#31639;&#38754;&#31215;&#30340;&#26041;&#27861;</span>
<span style="color: #ff0000;">*/</span>
<span style="color: #00ffff; font-weight: bold;">type</span> <span style="color: #00ff00;">Sharp</span> <span style="color: #00ffff; font-weight: bold;">struct</span> {
        r float64
}

<span style="color: #00ffff; font-weight: bold;">func</span> (s <span style="color: #00ff00;">Sharp</span>) <span style="color: #0000ff; font-weight: bold;">Square</span>() float64 {
        <span style="color: #00ffff; font-weight: bold;">return</span> s.r * s.r
}

<span style="color: #00ffff; font-weight: bold;">func</span> (s <span style="color: #00ff00;">Sharp</span>) <span style="color: #0000ff; font-weight: bold;">Circle</span>() float64 {
        <span style="color: #00ffff; font-weight: bold;">return</span> s.r * s.r * 3.14
}

<span style="color: #00ffff; font-weight: bold;">type</span> <span style="color: #00ff00;">Area</span> <span style="color: #00ffff; font-weight: bold;">interface</span> {
        <span style="color: #0000ff; font-weight: bold;">Square</span>() float64
        <span style="color: #0000ff; font-weight: bold;">Circle</span>() float64
}

<span style="color: #00ffff; font-weight: bold;">func</span> <span style="color: #0000ff; font-weight: bold;">main</span>() {
        <span style="color: #ff0000;">// </span><span style="color: #ff0000;">&#23454;&#20363;&#21270;&#31867;&#26041;&#27861;, &#24341;&#29992;</span>
        <span style="color: #00ffff; font-weight: bold;">var</span> sharpSquare Sharp = <span style="color: #00ff00;">Sharp</span>{4}
        <span style="color: #00ffff; font-weight: bold;">var</span> sharpCircle Sharp = <span style="color: #00ff00;">Sharp</span>{4}

        <span style="color: #ff0000;">// </span><span style="color: #ff0000;">&#23454;&#20363;&#21270;&#31867;&#26041;&#27861;&#65292;&#25351;&#38024;</span>
        <span style="color: #00ffff; font-weight: bold;">var</span> sharpSquare1 *Sharp = &amp;<span style="color: #00ff00;">Sharp</span>{4}
        <span style="color: #00ffff; font-weight: bold;">var</span> sharpCircle1 *Sharp = &amp;<span style="color: #00ff00;">Sharp</span>{4}

        <span style="color: #ff0000;">// </span><span style="color: #ff0000;">&#23454;&#20363;&#21270;&#31867;&#26041;&#27861;, &#20351;&#29992;new&#20851;&#38190;&#23383;</span>
        <span style="color: #ff0000;">// </span><span style="color: #ff0000;">new &#20998;&#37197;&#20102;0&#20540;&#22635;&#20805;&#30340;Sharp&#31867;&#22411;&#30340;&#20869;&#23384;&#31354;&#38388;&#65292;&#24182;&#19988;&#36820;&#22238;&#35813;&#31354;&#38388;&#30340;&#22320;&#22336;</span>
        sharpSquare2 := <span style="color: #0000ff; font-weight: bold;">new</span>(<span style="color: #00ff00;">Sharp</span>)
        sharpSquare2.r = 5

        fmt.<span style="color: #0000ff; font-weight: bold;">Println</span>(<span style="color: #00ff00;">"&#24341;&#29992;"</span>)
        fmt.<span style="color: #0000ff; font-weight: bold;">Println</span>(sharpSquare.<span style="color: #0000ff; font-weight: bold;">Square</span>())
        fmt.<span style="color: #0000ff; font-weight: bold;">Println</span>(sharpCircle.<span style="color: #0000ff; font-weight: bold;">Circle</span>())

        fmt.<span style="color: #0000ff; font-weight: bold;">Println</span>(<span style="color: #00ff00;">"&#25351;&#38024;"</span>)
        fmt.<span style="color: #0000ff; font-weight: bold;">Println</span>(sharpSquare1.<span style="color: #0000ff; font-weight: bold;">Square</span>())
        fmt.<span style="color: #0000ff; font-weight: bold;">Println</span>(sharpCircle1.<span style="color: #0000ff; font-weight: bold;">Circle</span>())

        fmt.<span style="color: #0000ff; font-weight: bold;">Println</span>(<span style="color: #00ff00;">"new&#20851;&#38190;&#23383;"</span>)
        fmt.<span style="color: #0000ff; font-weight: bold;">Println</span>(sharpSquare2.<span style="color: #0000ff; font-weight: bold;">Circle</span>())

        <span style="color: #ff0000;">// </span><span style="color: #ff0000;">Sharp &#23454;&#29616;&#20102;&#25509;&#21475;&#30340;&#20004;&#20010;&#26041;&#27861;&#65292;&#24050;&#32463;&#23454;&#29616;&#20102;&#35813;&#25509;&#21475;</span>
        <span style="color: #ff0000;">// </span><span style="color: #ff0000;">&#25509;&#21475;&#35843;&#29992;</span>
        fmt.<span style="color: #0000ff; font-weight: bold;">Println</span>(<span style="color: #00ff00;">"&#25509;&#21475;"</span>)
        <span style="color: #00ffff; font-weight: bold;">var</span> area1 Area = <span style="color: #00ff00;">Sharp</span>{6}
        fmt.<span style="color: #0000ff; font-weight: bold;">Println</span>(area1.<span style="color: #0000ff; font-weight: bold;">Square</span>())
        fmt.<span style="color: #0000ff; font-weight: bold;">Println</span>(area1.<span style="color: #0000ff; font-weight: bold;">Circle</span>())
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4-4" class="outline-4">
<h4 id="sec-1-4-4">多态</h4>
<div class="outline-text-4" id="text-1-4-4">
<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff; font-weight: bold;">package</span> main

<span style="color: #00ffff; font-weight: bold;">import</span> (
        <span style="color: #00ff00;">"fmt"</span>
)
<span style="color: #ff0000;">/*</span>
<span style="color: #ff0000;">    &#23450;&#20041;Square&#21644;Circle&#20004;&#20010;&#31867;</span>
<span style="color: #ff0000;">    &#20998;&#21035;&#23454;&#29616;Area&#26041;&#27861;</span>
<span style="color: #ff0000;">    &#23450;&#20041;&#25509;&#21475;PolySharp&#65292;&#25509;&#21475;&#26041;&#27861;Area</span>
<span style="color: #ff0000;">    Square&#21644;Circle&#30456;&#24403;&#20110;&#23454;&#29616;&#20102;&#25509;&#21475;PolySharp</span>
<span style="color: #ff0000;">*/</span>
<span style="color: #00ffff; font-weight: bold;">type</span> <span style="color: #00ff00;">Square</span> <span style="color: #00ffff; font-weight: bold;">struct</span> {
        width float64
}

<span style="color: #00ffff; font-weight: bold;">type</span> <span style="color: #00ff00;">Circle</span> <span style="color: #00ffff; font-weight: bold;">struct</span> {
        redius float64
}

<span style="color: #00ffff; font-weight: bold;">func</span> (s <span style="color: #00ff00;">Square</span>) <span style="color: #0000ff; font-weight: bold;">Area</span>() float64 {
        <span style="color: #00ffff; font-weight: bold;">return</span> s.width * s.width
}

<span style="color: #00ffff; font-weight: bold;">func</span> (s <span style="color: #00ff00;">Circle</span>) <span style="color: #0000ff; font-weight: bold;">Area</span>() float64 {
        <span style="color: #00ffff; font-weight: bold;">return</span> s.redius * s.redius * 3.14
}

<span style="color: #00ffff; font-weight: bold;">type</span> <span style="color: #00ff00;">PolySharp</span> <span style="color: #00ffff; font-weight: bold;">interface</span> {
        <span style="color: #0000ff; font-weight: bold;">Area</span>() float64
}

<span style="color: #00ffff; font-weight: bold;">func</span> <span style="color: #0000ff; font-weight: bold;">main</span>() {
        <span style="color: #00ffff; font-weight: bold;">var</span> s1 PolySharp = &amp;<span style="color: #00ff00;">Square</span>{4}
        <span style="color: #00ffff; font-weight: bold;">var</span> s2 PolySharp = &amp;<span style="color: #00ff00;">Circle</span>{4}
        fmt.<span style="color: #0000ff; font-weight: bold;">Println</span>(s1.<span style="color: #0000ff; font-weight: bold;">Area</span>())
        fmt.<span style="color: #0000ff; font-weight: bold;">Println</span>(s2.<span style="color: #0000ff; font-weight: bold;">Area</span>())
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">杂项</h3>
<div class="outline-text-3" id="text-1-5">
</div><div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1">函数定义文法</h4>
<div class="outline-text-4" id="text-1-5-1">
<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff; font-weight: bold;">type</span> <span style="color: #00ff00;">mytype</span> <span style="color: #00ff00;">int</span>
<span style="color: #00ffff; font-weight: bold;">func</span> (p <span style="color: #00ff00;">mytype</span>) <span style="color: #0000ff; font-weight: bold;">funcname</span>(i int) (r int) {
    <span style="color: #00ffff; font-weight: bold;">return</span> 0
}

<span style="color: #ff0000;">// </span><span style="color: #ff0000;">&#20851;&#38190;&#23383;func&#65292; &#32465;&#23450;&#21040;mytype&#19978;&#65288;&#21483;&#20570;&#26041;&#27861;method&#65289;&#65292; &#20989;&#25968;&#21517;&#65292; &#36820;&#22238;&#31867;&#22411;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5-2" class="outline-4">
<h4 id="sec-1-5-2">指针：Go语言的指针，基本上只剩下用于区分 byref 和 byval 语义。</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
解释： 值类型保存的是具体的值 引用类型保存的是值的地址。<br  />
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff; font-weight: bold;">package</span> main

<span style="color: #00ffff; font-weight: bold;">import</span> <span style="color: #00ff00;">"fmt"</span>

<span style="color: #00ffff; font-weight: bold;">func</span> <span style="color: #0000ff; font-weight: bold;">byval</span>(a int) {
    a += 5
    fmt.<span style="color: #0000ff; font-weight: bold;">Println</span>(a)
}

<span style="color: #00ffff; font-weight: bold;">func</span> <span style="color: #0000ff; font-weight: bold;">byref</span>(a *int) {
    fmt.<span style="color: #0000ff; font-weight: bold;">Println</span>(a)
    *a += 5
    fmt.<span style="color: #0000ff; font-weight: bold;">Println</span>(a)
}

<span style="color: #00ffff; font-weight: bold;">func</span> <span style="color: #0000ff; font-weight: bold;">main</span>() {
    a := 4;
    fmt.<span style="color: #0000ff; font-weight: bold;">Println</span>(a)
    <span style="color: #0000ff; font-weight: bold;">byval</span>(a)
    fmt.<span style="color: #0000ff; font-weight: bold;">Println</span>(a)
    <span style="color: #0000ff; font-weight: bold;">byref</span>(&amp;a)
    fmt.<span style="color: #0000ff; font-weight: bold;">Println</span>(a)
}

<span style="color: #ff0000;">/* </span><span style="color: #ff0000;">result</span>
<span style="color: #ff0000;">4</span>
<span style="color: #ff0000;">9</span>
<span style="color: #ff0000;">4</span>
<span style="color: #ff0000;">9</span>
<span style="color: #ff0000;">9</span>
<span style="color: #ff0000;">*/</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">总结</h3>
<div class="outline-text-3" id="text-1-6">
<ol class="org-ol">
<li>无侵入式的接口设计确实很新颖和优雅，仔细读代码简单明了。
</li>
<li>golang使用组合替代继承，符合OOP的设计原则。
</li>
<li>OOP的消息传递机制更直接。
</li>
</ol>


<p>
<!-- more -->
</p>
</div>
</div>
</div>
